## Plan Result (stg_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 5 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2023-11-30T12:35:27.5272171+00:00" -> (known after apply)
      ~ host_name                = "juror-public.staging.platform.hmcts.net" -> "juror-public.staging.apps.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public" -> (known after apply)
        name                     = "juror-public"
      ~ validation_token         = "8f7fj4bgthgh3rj6tk06l2lgdxqg22yx" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/secrets/0586d260-3084-452f-8ead-4397a0591065-juror-public-staging-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/associations/juror-public" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/associations/juror-public" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/juror-public/origins/juror-public"
        name                           = "juror-public"
      ~ origin_host_header             = "juror-public.staging.platform.hmcts.net" -> "juror-public.staging.apps.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      ~ host_name                      = "dualstack.iacfees-s-elbhmcts-dgd2ej56uxef-715536071.eu-west-1.elb.amazonaws.com" -> "dualstack.iacfees-s-ELBhmcts-DGD2EJ56UXEF-715536071.eu-west-1.elb.amazonaws.com"
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/staging-immigrationappealsonline/origins/staging-immigrationappealsonline"
        name                           = "staging-immigrationappealsonline"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/juror-public"
        name                            = "juror-public"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public",
        ] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/juror-publicHttpsRedirect"
        name                            = "juror-publicHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-public"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/jurorpublicstgPremium-securityPolicy" -> (known after apply)
        name                     = "jurorpublicstgPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/juror-public" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.juror-public.staging.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/staging.platform.hmcts.net/TXT/_dnsauth.juror-public" -> (known after apply)
      ~ name                = "_dnsauth.juror-public" -> "_dnsauth.juror-public.staging" # forces replacement
      - tags                = {} -> null
      ~ zone_name           = "staging.platform.hmcts.net" -> "apps.hmcts.net" # forces replacement
        # (2 unchanged attributes hidden)

      - record {
          - value = "8f7fj4bgthgh3rj6tk06l2lgdxqg22yx" -> null
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 5 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":631,"Program":"tfcmt","SHA1":"","Target":"stg_frontdoor","Vars":{}} -->